docs/notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-02 Fri 10:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<title>SWE 419 Notes</title>
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://dynaroars.github.io/files/org.css">
<link rel="alternative stylesheet" href="https://dynaroars.github.io/files/org-orig.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">SWE 419 Notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb8530ef">1. Lecture 2 (<span class="timestamp-wrapper"><span class="timestamp">&lt;2022-09-02 Fri&gt;</span></span>)</a></li>
<li><a href="#org2a43767">2. Lecture 1 (8/26)</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb8530ef" class="outline-2">
<h2 id="orgb8530ef"><span class="section-number-2">1.</span> Lecture 2 (<span class="timestamp-wrapper"><span class="timestamp">&lt;2022-09-02 Fri&gt;</span></span>)</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Groups: next time:  1 submission per group</li>

<li>Reconsider In-class 1B (class <code>User</code>)</li>
</ul>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #986801;">User</span> <span style="color: #6a1868;">u1</span> = <span style="color: #e45649;">new</span> <span style="color: #986801;">u1</span>(<span style="color: #50a14f;">"hello"</span>);
<span style="color: #986801;">User</span> <span style="color: #6a1868;">u2</span> = <span style="color: #e45649;">new</span> <span style="color: #986801;">User</span>(<span style="color: #b751b6;">null</span>);
u2.equals(u1); <span style="color: #9ca0a4;">//</span><span style="color: #9ca0a4;">contract:F, impl: F</span>
u1.equals(v2); <span style="color: #9ca0a4;">//</span><span style="color: #9ca0a4;">contract:F (Javadoc does not say it should raise exception), impl: exception</span>

<span style="color: #9ca0a4;">//</span><span style="color: #9ca0a4;">how to fix this?</span>
<span style="color: #9ca0a4;">//</span><span style="color: #9ca0a4;">Check for null and return False</span>
</pre>
</div>

<ul class="org-ul">
<li>Another example on how to obtain specs from documentation
<ul class="org-ul">
<li>consider <code>remove</code> from <code>iterator</code>: <a href="https://docs.oracle.com/javase/8/docs/api/java/util/Iterator.html">https://docs.oracle.com/javase/8/docs/api/java/util/Iterator.html</a>
<ul class="org-ul">
<li>Removes from the underlying collection the last element returned by this iterator (optional operation). This method can be called only once per call to next(). The behavior of an iterator is unspecified if the underlying collection is modified while the iteration is in progress in any way other than by calling this method.</li>
<li>Getting contracts/specs from the English description.
<ul class="org-ul">
<li>1st sentence: postcondition, specifying behavior</li>
<li>2nd:  post  or detail implementation</li>
<li>3rd:  post, side effects,  but could be a <b>precondition</b>:  statement that the collection should not be modified</li>
</ul></li>
</ul></li>
</ul></li>
</ul>


<ul class="org-ul">
<li>Strong Post vs Weak Pre</li>
</ul>

<p>
Precondition (P):
</p>
<ul class="org-ul">
<li>client/customer: establish  P</li>
</ul>
<p>
Postcondition (Q)
</p>
<ul class="org-ul">
<li>developer/implementation:  establish Q under assumption that P is established</li>
</ul>


<ul class="org-ul">
<li>If a program is not correct
<ul class="org-ul">
<li>if precondition is wrong: blame client</li>
<li>if (precondition is met) postcondition is wrong: blame developer</li>

<li>Reconsider the intdiv example from previous class</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #986801;">int</span> <span style="color: #a626a4;">intdiv</span>(<span style="color: #986801;">int</span> <span style="color: #6a1868;">x</span>, <span style="color: #986801;">int</span> <span style="color: #6a1868;">y</span>){
  <span style="color: #9ca0a4;">/*</span>
<span style="color: #9ca0a4;">  Return the integer division result x/y. </span>

<span style="color: #9ca0a4;">  precond:</span>
<span style="color: #9ca0a4;">  - x and y are integers # (already given in type)</span>
<span style="color: #9ca0a4;">  - y cannot be zero   # better if we can remove this</span>

<span style="color: #9ca0a4;">  postcond:</span>
<span style="color: #9ca0a4;">  - z is a number  # weak</span>
<span style="color: #9ca0a4;">  - z is an integer  # weak</span>
<span style="color: #9ca0a4;">  - z = x // y  # strong</span>
<span style="color: #9ca0a4;">  */</span>

  <span style="color: #e45649;">return</span> z
}
</pre>
</div>



<ul class="org-ul">
<li>Total vs Partial contract
<ul class="org-ul">
<li>partial specification:  has a precondition</li>
<li>total specification:  has NO precondition</li>
</ul></li>

<li><p>
how to turn a partial into a total specification?
//partial spec
sqrt(x):
   precondition: x &gt;= 0
   postcondition:  y*y == x (-/+ epsilon)
</p>

<p>
//total spec
sqrt(x):
   precondition: 
   postcondition:
       //if x &lt; 0:  raise exception
       //ow.  y*y == x (-/+ epsilon)
</p>

<p>
//div_xy(x,y):   output = x/y
partial spec:
 precond:  y != 0
 post :   y*output == x
</p>

<p>
total spec:
  precond: true
  postcondition:   if y is 0, raise exception(DivByZero);
  y*output = 
</p></li>

<li>In-class 2A (<code>tail</code> implementation)
<ul class="org-ul">
<li>Discussion</li>
</ul></li>

<li>If have time, do 2B</li>

<li>If have more time,  do basic logic terminologies</li>
</ul>
</div>
</div>


<div id="outline-container-org2a43767" class="outline-2">
<h2 id="org2a43767"><span class="section-number-2">2.</span> Lecture 1 (8/26)</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3832e58" class="outline-3">
<h3 id="org3832e58"><span class="section-number-3">2.1.</span> Specification Example</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Sorting (e.g., quicksort)
</p>
<ul class="org-ul">
<li>Input: a list of integers numbers, e.g., [2,1,5,10]</li>

<li>Output:  
<ul class="org-ul">
<li><b>output is a permutation of input</b> and <b>output is in sored sorder (e.g., ascending)</b></li>
</ul></li>

<li>Alg:
<ul class="org-ul">
<li>additional requirements, e.g., (involving pivot, worst case complexity n^2, amortized nlg n)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org379b159" class="outline-3">
<h3 id="org379b159"><span class="section-number-3">2.2.</span> Definitions</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Software Specifications (e.g., specification of a program/methoad/function)
</p>
<ul class="org-ul">
<li><b>Preconditions</b>: properties of the Inputs</li>
<li><b>Postconditions</b>: properties of the Outputs
<ul class="org-ul">
<li>Typically will have some relationships with the inputs</li>
</ul></li>
</ul>
<ul class="org-ul">
<li>Additional properties/specifications that are common for all software (desirable, but very hard to achieve)
<ul class="org-ul">
<li>secured</li>
<li>robust</li>
<li>bugs-free</li>
<li>efficiently</li>
</ul></li>

<li>Specification of a program: precondition + postcondition</li>
<li>Correctness: A program (implementation) is <b>correct</b> if it satifies the given specifications (i.e., pre/post conditions).</li>
</ul>
</div>
</div>

<div id="outline-container-orga557f4b" class="outline-3">
<h3 id="orga557f4b"><span class="section-number-3">2.3.</span> Another example</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a626a4;">int</span> intdiv(<span style="color: #a626a4;">int</span> x, <span style="color: #a626a4;">int</span> y):
  /*
  <span style="color: #6a1868;">precond</span>: x <span style="color: #e45649;">and</span> y are integers, y cannot be zero
  postcond: z = x // y
  */


  <span style="color: #e45649;">return</span> z

</pre>
</div>
</div>
</div>



<div id="outline-container-org6845b03" class="outline-3">
<h3 id="org6845b03"><span class="section-number-3">2.4.</span> In class Exercise (User, equals)</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org02aee8c" class="outline-4">
<h4 id="org02aee8c"><span class="section-number-4">2.4.1.</span> Truth table for Implication (=&gt;)</h4>
<div class="outline-text-4" id="text-2-4-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">X</th>
<th scope="col" class="org-left">Y</th>
<th scope="col" class="org-left">X =&gt; Y</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">T</td>
<td class="org-left">T</td>
<td class="org-left">T</td>
</tr>

<tr>
<td class="org-left">T</td>
<td class="org-left">F</td>
<td class="org-left">F</td>
</tr>

<tr>
<td class="org-left">F</td>
<td class="org-left">T</td>
<td class="org-left">T</td>
</tr>

<tr>
<td class="org-left">F</td>
<td class="org-left">F</td>
<td class="org-left">T</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Be careful about implication, the formula `X =&gt; Y` is only False when `X` is True but `Y` is False, in every other cases, the formula is True.</li>
</ul>
</div>
</div>


<div id="outline-container-org036ce9a" class="outline-4">
<h4 id="org036ce9a"><span class="section-number-4">2.4.2.</span> Expected properties for an implementation of `equals` (according to <a href="https://docs.oracle.com/javase/7/docs/api/java/lang/Object.html#equals(java.lang.Object)">https://docs.oracle.com/javase/7/docs/api/java/lang/Object.html#equals(java.lang.Object)</a>)</h4>
<div class="outline-text-4" id="text-2-4-2">
<ol class="org-ol">
<li>reflexive: `a == a`</li>
<li>symmetry:   `a <code>= b &lt;=&gt;  b =</code> a`</li>
<li>transitive: `a <code>= b &amp;&amp; b =</code> c  <code>&gt;  a =</code> c`</li>
</ol>


<ul class="org-ul">
<li>Examples</li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #986801;">User</span> <span style="color: #6a1868;">u1</span> = <span style="color: #e45649;">new</span> <span style="color: #986801;">User</span>(<span style="color: #50a14f;">"hello"</span>);
<span style="color: #986801;">User</span> <span style="color: #6a1868;">u2</span> = <span style="color: #e45649;">new</span> <span style="color: #986801;">User</span>(<span style="color: #50a14f;">"world"</span>)
User u3 = <span style="color: #e45649;">new</span> <span style="color: #986801;">User</span>(<span style="color: #50a14f;">"swe419"</span>);

<span style="color: #986801;">User</span> <span style="color: #6a1868;">u1a</span> = <span style="color: #e45649;">new</span> <span style="color: #986801;">User</span>(<span style="color: #50a14f;">"hello"</span>);
<span style="color: #986801;">User</span> <span style="color: #6a1868;">u1b</span> = <span style="color: #e45649;">new</span> <span style="color: #986801;">User</span>(<span style="color: #50a14f;">"hello"</span>);
<span style="color: #986801;">User</span> <span style="color: #6a1868;">u2a</span> = <span style="color: #e45649;">new</span> <span style="color: #986801;">User</span>(<span style="color: #50a14f;">"world"</span>);

<span style="color: #986801;">SpecialUser</span> <span style="color: #6a1868;">s1</span> = <span style="color: #e45649;">new</span> <span style="color: #986801;">SpecialUser</span>(<span style="color: #50a14f;">"hello"</span>, 1)
</pre>
</div>


<p>
For the equal implementation in In-class 1B for <code>User</code>.
</p>

<ul class="org-ul">
<li>Reflexive: OK
<ul class="org-ul">
<li>e.g., <code>u1.equals(u1): contract: T   impl: T</code></li>
</ul></li>

<li>symmetry: OK
<ul class="org-ul">
<li>e.g., <code>u1.equals(u2): False  &amp;&amp; u2.equals(u1): False    contract: F   impl: F</code></li>
<li><code>u1.equals(u1a): T  &amp;&amp; u1a.equals(u1): T  contract: T  impl: T</code></li>
</ul></li>

<li>Transitive: OK
<ul class="org-ul">
<li>e.g., <code>u1.equals(u2) &amp;&amp;  u2.equals(u3) =&gt;  u1.equals(u3) contract: T impl: T</code>,</li>
<li><code>u1.equals(u2a) &amp;&amp;  u2a.equals(u2b)  contract: T   impl: T</code></li>
</ul></li>
</ul>


<p>
Things become more complicated when involving inheritence
</p>

<ul class="org-ul">
<li>Symmetry: Not OK
<ul class="org-ul">
<li><code>u1.equals(s1)    impl:  T</code></li>
<li><code>s1.equals(u1)    impl:  F</code></li>
</ul></li>

<li><p>
A potential fix (suggested by a student)
</p>
<div class="org-src-container">
<pre class="src src-java">SpecialUser
      <span style="color: #b751b6;">@Override</span> <span style="color: #e45649;">public</span> <span style="color: #986801;">boolean</span> <span style="color: #a626a4;">equals</span> (<span style="color: #986801;">Object</span> <span style="color: #6a1868;">obj</span>) {
      <span style="color: #e45649;">if</span> (<span style="color: #4078f2; font-weight: bold;">!</span>(obj <span style="color: #e45649;">instanceof</span> SpecialUser)) <span style="color: #e45649;">return</span> <span style="color: #e45649;">super</span>.equal(obj); <span style="color: #9ca0a4;">//</span><span style="color: #9ca0a4;">obj.equals(this)</span>
       <span style="color: #e45649;">return</span> <span style="color: #e45649;">super</span>.equals(obj) &amp;&amp; ((<span style="color: #986801;">SpecialUser</span>) obj).id == <span style="color: #e45649;">this</span>.id;
      }

</pre>
</div></li>
</ul>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
